## Python 基礎

In [4]:
a = 3 
b = 2 
a + b

5

In [2]:
b

2

## 使用Python 寫資料入檔案

In [5]:
fid = open('test.txt', 'w')
fid.write('Hello\nWorld')
fid.close()

if(a > 3){    
    System.out.println('a is above 3');
}

In [6]:
a = 5
if a > 3:
    print('a is above 3')

a is above 3

In [7]:
with open('test.txt','w') as f:
    f.write('Hello\nWorld')

In [9]:
with open('test.txt', 'r') as fid:
    for line in fid:
        print line

Hello

World

In [11]:
with open('test.txt', 'r') as fid:
    s = fid.read()
print 'line', s

line Hello
World

## 讀取半結構化資料與結構化資料

In [13]:
import pandas
df = pandas.read_json('2330.json')
df

   Adj Close  Close       Date   High    Low   Open    Volume
0      172.0  172.0 2016-07-21  172.0  170.0  171.0  33130000
1      170.0  170.0 2016-07-20  170.5  169.0  170.0  38053000
2      170.5  170.5 2016-07-19  170.5  169.0  170.5  42456000
3      169.5  169.5 2016-07-18  170.0  168.0  168.0  24749000
4      169.5  169.5 2016-07-15  169.5  169.5  169.5     41000

In [17]:
import pandas
df = pandas.read_csv('tw2330.csv')
df.head()

         Date   Open   High    Low  Close    Volume  Adj Close
0  2016-07-21  171.0  172.0  170.0  172.0  33130000      172.0
1  2016-07-20  170.0  170.5  169.0  170.0  38053000      170.0
2  2016-07-19  170.5  170.5  169.0  170.5  42456000      170.5
3  2016-07-18  168.0  170.0  168.0  169.5  24749000      169.5
4  2016-07-15  169.5  169.5  169.5  169.5     41000      169.5

In [20]:
import pandas
df = pandas.read_excel('new.xlsx')
df

,年(n),名目利率 (Rn),Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,2%,4%,6%,8%,10%,12%,14%,16%,18%
1,1.0,102,104,106,108,110,112,114,116,118
2,2.0,104,108,112,116,120,124,128,132,136
3,3.0,106,112,118,124,130,136,142,148,154
4,4.0,108,116,124,132,140,148,156,164,172

In [21]:
import pandas
df = pandas.read_clipboard()
df

   年(n) 名目利率 (Rn) Unnamed:      2  Unnamed:.1   3
0     0   2%   4%       6%    NaN         NaN NaN
1     1    1  102      104  106.0         NaN NaN
2     2    2  104      108  112.0         NaN NaN
3     3    3  106      112  118.0         NaN NaN
4     4    4  108      116  124.0         NaN NaN